import React from 'react';
import BackButton from '../components/BackButton';

function Workflow (){
  return (
    <div style={{ marginLeft: '220px', padding: '20px', position: 'relative' }}>
      <BackButton />
      <div style={{ marginTop: '60px' }}>
        <h2>工作流程</h2>
        <div>
          <h2>极光1000智能计算机平台数据处理流程</h2>
          <p>极光1000智能计算机平台旨在提供高效的数据处理解决方案。以下是平台的工作流程：</p>

          <h3>1. 卫星平台指令控制</h3>
          <p>卫星平台接收并执行来自地面站的指令，启动数据采集流程。</p>

          <h3>2. 数据采集与传输</h3>
          <p><b>相机载荷：</b>相机载荷根据指令采集图像数据，并将数据传输至存储单元。<br/>
            <b>存储单元/数传单元：</b>图像数据被暂存于存储单元，等待传输至星上智能处理单元。</p>

          <h3>3. 星上智能处理单元处理数据</h3>
          <p>星上智能处理单元接收并处理图像数据，进行初步分析和处理。</p>

          <h3>4. 数据传输至地面站</h3>
          <p><b>数据回传：</b>处理后的数据通过卫星平台传输至地面站。<br/>
            <b>遥测遥控：</b>地面站对卫星平台进行实时监控和控制，确保数据传输的稳定性和可靠性。</p>

          <h3>5. 地面站数据接收与处理</h3>
          <p>地面站接收到数据后，进行进一步处理和存储，并生成最终报告和分析结果。</p>

          <h3>6. 地面仿真与模拟</h3>
          <p><b>卫星数据模拟器：</b>模拟地面站与卫星平台的数据交互和处理流程。<br/>
            <b>上位机：</b>模拟星上智能处理单元和相机载荷的指令交互和数据传输，确保系统的整体协调和优化。</p>

          <h3>7. 智能计算载荷</h3>
          <p>地面仿真过程中的智能计算载荷进行复杂计算任务，提供数据分析和决策支持。</p>
        </div>
      </div>
    </div>
  );
}

export default Workflow;
